---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures.MergedPartHasDisConnectedGeometries
source: html/92ae3a14-5655-be0a-ed4f-544184643e70.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures.MergedPartHasDisConnectedGeometries Property

A merged part geometry has dis-connected components.

## Syntax (C#)
```csharp
public static FailureDefinitionId MergedPartHasDisConnectedGeometries { get; }
```